<a href="https://colab.research.google.com/github/turnip-python/colab/blob/master/firststep.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# FIRST STEP

In [0]:
import pandas as pd

training_df = pd.read_csv('https://raw.githubusercontent.com/turnip-python/colab/master/7974_2017.csv', encoding='sjis', skiprows=2, usecols=[0, 1, 2, 3, 5, 6],
                          names=['date', 'open', 'high', 'low', 'volume', 'close'], index_col='date', parse_dates=['date'])[['open', 'high', 'low', 'close', 'volume']]
test_df = pd.read_csv('https://raw.githubusercontent.com/turnip-python/colab/master/7974_2018.csv', encoding='sjis', skiprows=2, usecols=[0, 1, 2, 3, 5, 6],
                          names=['date', 'open', 'high', 'low', 'volume', 'close'], index_col='date', parse_dates=['date'])[['open', 'high', 'low', 'close', 'volume']]

In [43]:
display(training_df.head())
display(test_df.head())

             open   high    low  close   volume
date
2017-01-04  24540  24545  24330  24480  1437600
2017-01-05  24555  24840  23875  24085  2546200
2017-01-06  24000  24215  23920  24050  1443500
2017-01-10  24490  24530  24185  24370  1725900
2017-01-11  24650  25350  24580  25145  3224400

             open   high    low  close   volume
date
2018-01-04  42120  43250  41820  43210  2917700
2018-01-05  43600  43620  42500  42610  2493900
2018-01-09  43000  43470  42700  43140  2222100
2018-01-10  43390  44300  43000  44230  2446600
2018-01-11  43860  44140  43700  44120  1553600